app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @product = Product.new(product_params)
    @product.save!

UPDATE "products" SET "updated_at" = $1 WHERE "products"."id" = $2  [["updated_at", "2020-03-05 03:58:59.727504"], ["id", 2]]
---
  def update
    @product.update!(product_params)