app/controllers/users_controller.rb

INSERT INTO "users" ("email", "name", "surname", "cpf", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @user.save!